#+TITLE:
#+AUTHOR: António Mendes
#+DATE: 06 / 12 / 20
#+email: 17amendes@gmail.com
#+PROPERTY: header-args :exports both :session _watermark :results value
#+OPTIONS: toc:nil num:nil
#+LaTeX_HEADER: \usepackage[left=3.5cm, top=2.5cm, right=3.5cm, includefoot]{geometry}
-----

**** Folders for Each Search Term
#+BEGIN_SRC python
PEXELS_API_KEY = "563492ad6f91700001000001f8f1cdfad4e84affa3d8bb8ea5312020"

api = API(PEXELS_API_KEY)

for i, search_term in enumerate(tqdm(search_terms)):
  print("search_term: ", search_term)
  search = api.search(search_term, page=1, results_per_page=40)
  photos = api.get_entries()
  folder_name = "_".join(search_term.split(" "))
  folder_dir = pexel_img_dir / folder_name
  if folder_dir.exists() == False: 
    os.mkdir(folder_dir)
  for j,photo in enumerate(photos):
    #img_url = photo.compressed
    #img_url = photo.large
    img_url = photo.medium
    filename = str(search_term + "_" + str(j) + ".jpg")
    r = requests.get(img_url, stream=True)
    if r.status_code == 200:
      with open(folder_dir / filename, 'wb') as f:
        r.raw.decode_content = True
        shutil.copyfileobj(r.raw, f)
#+END_SRC

#+RESULTS:
: 3

** Make =watermark_df= 
#+BEGIN_SRC python 
pexel_images = os.listdir(pexel_img_dir)
if ".DS_Store" in pexel_images:
  pexel_images.remove(".DS_Store")

wm_pexel_images = os.listdir(watermark_pexel_img_dir)
if ".DS_Store" in wm_pexel_images:
  wm_pexel_images.remove(".DS_Store")

watermark_df = pd.DataFrame({
  "image_name" : np.append(pexel_images, wm_pexel_images),
  "has_watermark" : np.append(np.zeros(len(pexel_images)), np.ones(len(wm_pexel_images))).astype(int)
})

watermark_df.shape
#+END_SRC

#+RESULTS:
| 2 | 2 |

*** Save =watermark_df=
#+BEGIN_SRC python
watermark_df.to_csv(data_dir / "watermark_df.csv")
#+END_SRC

#+RESULTS:
: 3

**** train
#+BEGIN_SRC python
batch_size = 1
img_height = 256
img_width = 256

train_normal = tf.keras.preprocessing.image_dataset_from_directory(
  pexel_img_dir,
  validation_split=0.2,
  subset="training",
  color_mode="rgb",
  seed=123,
  image_size=(img_height, img_width),
  batch_size=batch_size
)

train_normal
#+END_SRC

#+RESULTS:
: <BatchDataset shapes: ((None, 256, 256, 3), (None,)), types: (tf.float32, tf.int32)>

**** test
#+BEGIN_SRC python
batch_size = 1
img_height = 256
img_width = 256

test_normal = tf.keras.preprocessing.image_dataset_from_directory(
  pexel_img_dir,
  validation_split=0.2,
  subset="validation",
  color_mode="rgb",
  seed=123,
  image_size=(img_height, img_width),
  batch_size=batch_size
)

test_normal
#+END_SRC

#+RESULTS:
: <BatchDataset shapes: ((None, 256, 256, 3), (None,)), types: (tf.float32, tf.int32)>
**** train
#+BEGIN_SRC python
batch_size = 1
img_height = 256
img_width = 256

train_watermark = tf.keras.preprocessing.image_dataset_from_directory(
  watermark_pexel_img_dir,
  validation_split=0.2,
  subset="training",
  color_mode="rgb",
  seed=123,
  image_size=(img_height, img_width),
  batch_size=batch_size
)

train_watermark
#+END_SRC

#+RESULTS:
: <BatchDataset shapes: ((None, 256, 256, 3), (None,)), types: (tf.float32, tf.int32)>

**** test
#+BEGIN_SRC python
batch_size = 1
img_height = 256
img_width = 256

test_watermark = tf.keras.preprocessing.image_dataset_from_directory(
  watermark_pexel_img_dir,
  validation_split=0.2,
  subset="validation",
  color_mode="rgb",
  seed=123,
  image_size=(img_height, img_width),
  batch_size=batch_size
)

test_watermark
#+END_SRC

#+RESULTS:
: <BatchDataset shapes: ((None, 256, 256, 3), (None,)), types: (tf.float32, tf.int32)>

** Checkpoints 
#+BEGIN_SRC python
checkpoint_path = "./checkpoints/train"

ckpt = tf.train.Checkpoint(generator_g=generator_g,
                           generator_f=generator_f,
                           discriminator_x=discriminator_x,
                           discriminator_y=discriminator_y,
                           generator_g_optimizer=generator_g_optimizer,
                           generator_f_optimizer=generator_f_optimizer,
                           discriminator_x_optimizer=discriminator_x_optimizer,
                           discriminator_y_optimizer=discriminator_y_optimizer)

ckpt_manager = tf.train.CheckpointManager(ckpt, checkpoint_path, max_to_keep=5)

# if a checkpoint exists, restore the latest checkpoint.
if ckpt_manager.latest_checkpoint:
  ckpt.restore(ckpt_manager.latest_checkpoint)
  print ('Latest checkpoint restored!!')
#+END_SRC

#+RESULTS:
: <tensorflow.python.training.tracking.util.CheckpointLoadStatus object at 0x270848f60>
